# Pandas

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [ ]:
df = pd.DataFrame(data=data, index = labels)

#### 1. Вывести информацию о датафрейме.

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [ ]:
df[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [ ]:
df[["animal", "age"]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [ ]:
df.iloc[[3, 4, 8], :].loc[:, ["animal", "age"]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

#### 5. Выберите строки где количество посещений больше 3.

In [ ]:
df[df["visits"] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [ ]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [ ]:
df[(df["animal"] == 'cat') & (df.age < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [ ]:
df[(df["age"] >= 2) & (df["age"] <= 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

#### 9. Измените возраст в строке 'f' на 1,5.

In [ ]:
df.loc['f', 'age'] = 1.5

#### 10. Рассчитать общее количество всех посещений.

In [ ]:
print("Общее количество посещений: ", df['visits'].sum())

Общее количество посещений:  19

#### 11. Расчитайте суммарный возраст животных

In [ ]:
print("Суммарный возраст животных: ", df['age'].sum())

Суммарный возраст животных:  27.0

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [ ]:
df.loc['k', :] = ['cat', 2.5, 3, "yes"]

In [ ]:
df.tail()

  animal  age  visits priority
g  snake  4.5     1.0       no
h    cat  NaN     1.0      yes
i    dog  7.0     2.0       no
j    dog  3.0     1.0       no
k    cat  2.5     3.0      yes

In [ ]:
df.drop(labels = 'k', axis=0, inplace=True)

In [ ]:
df.tail()

  animal  age  visits priority
f    cat  1.5     3.0       no
g  snake  4.5     1.0       no
h    cat  NaN     1.0      yes
i    dog  7.0     2.0       no
j    dog  3.0     1.0       no

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [ ]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [ ]:
df.sort_values(['age', 'visits'], ascending=[True, True])

  animal  age  visits priority
c  snake  0.5     2.0       no
f    cat  1.5     3.0       no
a    cat  2.5     1.0      yes
j    dog  3.0     1.0       no
b    cat  3.0     3.0      yes
g  snake  4.5     1.0       no
e    dog  5.0     2.0       no
i    dog  7.0     2.0       no
h    cat  NaN     1.0      yes
d    dog  NaN     3.0      yes

#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [ ]:
df['priority'].replace(to_replace=['yes', 'no'], value=['Yes', 'No'], inplace = True)
df

  animal  age  visits priority
a    cat  2.5     1.0      Yes
b    cat  3.0     3.0      Yes
c  snake  0.5     2.0       No
d    dog  NaN     3.0      Yes
e    dog  5.0     2.0       No
f    cat  1.5     3.0       No
g  snake  4.5     1.0       No
h    cat  NaN     1.0      Yes
i    dog  7.0     2.0       No
j    dog  3.0     1.0       No

#### 16. В столбце «animal» измените записи «snake» на «python».

In [ ]:
df['animal'].replace(to_replace='snake', value='python', inplace = True)
df

   animal  age  visits priority
a     cat  2.5     1.0      Yes
b     cat  3.0     3.0      Yes
c  python  0.5     2.0       No
d     dog  NaN     3.0      Yes
e     dog  5.0     2.0       No
f     cat  1.5     3.0       No
g  python  4.5     1.0       No
h     cat  NaN     1.0      Yes
i     dog  7.0     2.0       No
j     dog  3.0     1.0       No

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [ ]:
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

df.drop_duplicates()

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [ ]:
df = pd.DataFrame(np.random.random_sample(size = (5, 10)), columns = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [ ]:
df.sum(axis = 0)

a    2.041013
b    2.938827
c    3.673521
d    2.208247
e    4.115765
f    1.092099
g    1.244696
h    3.331448
i    3.419963
j    1.092364
dtype: float64

In [ ]:
df.sum(axis = 0).idxmin()

'f'

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [ ]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})

In [ ]:
df

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [ ]:
df.fillna(value = df.mean(), inplace = True)

In [ ]:
df

   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [ ]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

In [ ]:
df["From"] = df["From_To"].apply(lambda x: x.split('_')[0].capitalize())
df["To"] = df["From_To"].apply(lambda x: x.split('_')[1].capitalize())

In [ ]:
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    London      Paris
1      MAdrid_miLAN           NaN  ...    Madrid      Milan
2  londON_StockhOlm       10065.0  ...    London  Stockholm
3    Budapest_PaRis           NaN  ...  Budapest      Paris
4   Brussels_londOn       10085.0  ...  Brussels     London

[5 rows x 6 columns]